app/views/g_cidades/_form.html.erb

SELECT "g_estados".* FROM "g_estados" ORDER BY "g_estados"."nome_fantasia" ASC
---
        <div class="col-12">
          <%= f.association :g_estado, collection: GEstado.all.order(:nome_fantasia), label_method: :nome_fantasia, value_method: :id, input_html: { class: "capitalize" }, prompt: "Selecione um estado" %>