app/views/devise/registrations/new.html.erb

            <i class="fas fa-user-tag input-icon"></i>
            <%= f.input :g_tipo_usuario_id, as: :select, collection: GTipoUsuario.all.collect { |gtu| [gtu.descricao, gtu.id] }, prompt: "Selecione uma função", input_html: { class: "form-control", required: true }, label: false %>
---
SELECT "g_tipo_usuarios".* FROM "g_tipo_usuarios"