app/views/devise/registrations/new.html.erb

SELECT "g_tipo_usuarios".* FROM "g_tipo_usuarios"
---
            <div class="mb-3">
              <%= f.input :g_tipo_usuario_id, as: :select, collection: GTipoUsuario.all.collect { |gtu| [gtu.descricao, gtu.id] }, prompt: "Selecione uma função", input_html: { class: "form-select form-select-lg" }, label: false %>