app/views/a_unidade_treinamentos/_form.html.erb

        <div class="col-12">
          <%= f.association :a_zona_treinamento, collection: AZonaTreinamento.all.order(:descricao), label_method: :descricao,  value_method: :id, input_html: { class: "capitalize" }, prompt: "Selecione uma zona de treinamento" %>
---
SELECT "a_zona_treinamentos".* FROM "a_zona_treinamentos" ORDER BY "a_zona_treinamentos"."descricao" ASC