app/views/a_atletas/_form.html.erb

        <div class="col-3">
          <%= f.association :g_estado, collection: GEstado.all.order(:nome_fantasia), label_method: :nome_fantasia, value_method: :id, input_html: { class: "capitalize" }, prompt: "Selecione um estado" %>
---
SELECT "g_estados".* FROM "g_estados" ORDER BY "g_estados"."nome_fantasia" ASC

        <div class="col-3">
          <%= f.association :g_cidade, collection: GCidade.all.order(:nome_fantasia), label_method: :nome_fantasia, value_method: :id, input_html: { class: "capitalize" }, prompt: "Selecione uma cidade" %>
---
SELECT "g_cidades".* FROM "g_cidades" ORDER BY "g_cidades"."nome_fantasia" ASC

        <div class="col-3">
          <%= f.association :a_unidade_treinamento, collection: AUnidadeTreinamento.all.order(:descricao), label_method: :descricao, value_method: :id, input_html: { class: "capitalize" }, prompt: "Selecione uma unidade" %>
---
SELECT "a_unidade_treinamentos".* FROM "a_unidade_treinamentos" ORDER BY "a_unidade_treinamentos"."descricao" ASC

        <div class="col-3">
          <%= f.association :a_sexo, collection: ASexo.all.order(:descricao), label_method: :descricao, value_method: :id, input_html: { class: "capitalize" }, prompt: "Selecione um sexo" %>
---
SELECT "a_sexos".* FROM "a_sexos" ORDER BY "a_sexos"."descricao" ASC