app/controllers/a_atletas_controller.rb

  def create
    @a_atleta = AAtleta.new(a_atleta_params)

    if @a_atleta.save
---
INSERT INTO "a_atletas" ("nome", "cpf", "data_nascimento", "contato1", "contato2", "nacionalidade", "nome_pai", "nome_mae", "responsavel_nome", "responsavel_cpf", "responsavel_rg", "responsavel_orientacao", "portador_necessidade", "descricao_necessidade", "cep", "rua", "bairro", "numero", "complemento", "g_estado_id", "g_cidade_id", "a_unidade_treinamento_id", "a_sexo_id", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28) RETURNING "id"

  def update
    if @a_atleta.update(a_atleta_params)
---
UPDATE "a_atletas" SET "updated_at" = $1 WHERE "a_atletas"."id" = $2  [["updated_at", "2025-07-26 18:23:56.942068"], ["id", 1]]

  def destroy
    if @a_atleta.destroy
---
DELETE FROM "a_atletas" WHERE "a_atletas"."id" = $1  [["id", 2]]

  def set_a_atleta
    @a_atleta = AAtleta.find_by(id: params[:id])
---
SELECT "a_atletas".* FROM "a_atletas" WHERE "a_atletas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]