app/controllers/a_sexos_controller.rb

  def create
    @a_sexo = ASexo.new(a_sexo_params)

    if @a_sexo.save
---
INSERT INTO "a_sexos" ("descricao", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["descricao", "Masculino"], ["created_by", nil], ["updated_by", nil], ["deleted_at", nil], ["created_at", "2025-07-26 17:57:24.697536"], ["updated_at", "2025-07-26 17:57:24.697536"]]