app/controllers/a_unidade_treinamentos_controller.rb

  def create
    @a_unidade_treinamento = AUnidadeTreinamento.new(a_unidade_treinamento_params)

    if @a_unidade_treinamento.save
---
INSERT INTO "a_unidade_treinamentos" ("descricao", "a_zona_treinamento_id", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"