app/controllers/a_zona_treinamentos_controller.rb

  def create
    @a_zona_treinamento = AZonaTreinamento.new(a_zona_treinamento_params)

    if @a_zona_treinamento.save
---
INSERT INTO "a_zona_treinamentos" ("descricao", "created_by", "updated_by", "deleted_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["descricao", "Zona Sul"], ["created_by", nil], ["updated_by", nil], ["deleted_at", nil], ["created_at", "2025-07-24 10:00:57.079133"], ["updated_at", "2025-07-24 10:00:57.079133"]]